In [3]:
import numpy as np
import pandas as pd 
import cv2 as cv

In [4]:
hari=pd.read_csv("D:\\New_sales.csv")
print(hari)

      Unnamed: 0       State  Total_Expenses  Sales  Profit   Market  Trade  \
0              0  California            63.0  109.0  -131.0     West     40
1              1  California            55.0  201.0    88.0     West     24
2              2  California           700.0  289.0    25.0     West    109
3              3  California           113.0  576.0   216.0     West     81
4              4  California            37.0  247.0   148.0     West     26
...          ...         ...             ...    ...     ...      ...    ...
4224        4236   Wisconsin            34.0   90.0    20.0  Central     11
4225        4237   Wisconsin            36.0  113.0    31.0  Central     14
4226        4238   Wisconsin            86.0  150.0     1.0  Central     57
4227        4239   Wisconsin            79.0  131.0    -3.0  Central     49
4228        4240   Wisconsin            87.0  165.0     4.0  Central     58

     Product_Type  Inventory     Type  New_Column
0          Coffee     2947.0  Regular       172.0
1             Tea      659.0  Regular       256.0
2        Espresso      788.0  Regular       989.0
3        Espresso     1744.0    Decaf       689.0
4      Herbal Tea      809.0    Decaf       284.0
...           ...        ...      ...         ...
4224          Tea      458.0  Regular       124.0
4225          Tea      454.0  Regular       149.0
4226          Tea      506.0  Regular       236.0
4227          Tea      627.0  Regular       210.0
4228          Tea      513.0  Regular       252.0

[4229 rows x 11 columns]

In [6]:
hari.columns

Index(['Unnamed: 0', 'State', 'Total_Expenses', 'Sales', 'Profit', 'Market',
       'Trade', 'Product_Type', 'Inventory', 'Type', 'New_Column'],
      dtype='object')

In [12]:
h=hari.iloc[[1,2,3]]
print(h)

   Unnamed: 0       State  Total_Expenses  Sales  Profit Market  Trade  \
1           1  California            55.0  201.0    88.0   West     24
2           2  California           700.0  289.0    25.0   West    109
3           3  California           113.0  576.0   216.0   West     81

  Product_Type  Inventory     Type  New_Column
1          Tea      659.0  Regular       256.0
2     Espresso      788.0  Regular       989.0
3     Espresso     1744.0    Decaf       689.0

In [21]:
hisales=(hari['Sales']> 200)
hari.loc[hisales,["New_Column","Sales","Market"]]

      New_Column  Sales   Market
1          256.0  201.0     West
2          989.0  289.0     West
3          689.0  576.0     West
4          284.0  247.0     West
5          681.0  582.0     West
...          ...    ...      ...
4201       453.0  314.0  Central
4202       270.0  212.0  Central
4203       286.0  227.0  Central
4204       270.0  215.0  Central
4206       279.0  226.0  Central

[1334 rows x 3 columns]